#include "delay.h"

uint32_t timeout = 0;

/**************************************************************************************
* 函数名：SysTick_Handler()
* 参数  ：void
* 返回值：void
* 描述  ：系统节拍中断服务函数
***************************************************************************************/
void SysTick_Handler(void)
{
    /*定时计数自减1*/
    timeout--;
}
/**************************************************************************************
* 函数名：systick_hw_init()
* 参数  ：void
* 返回值：void
* 描述  ：系统节拍初始化函数
***************************************************************************************/
void systick_hw_init(void)
{
    //选择系统节拍定时器的时钟源为系统内核时钟
    SysTick->CTRL |= 0x01 << 2;
    //设置重装值，配置系统节拍定时器为1ms中断一次
    /*1ms <-->SystemCoreClock/1000
    * 100us <-->SystemCoreClock/10000
    * 10us <-->SystemCoreClock/100000
    */
    SysTick->LOAD = SystemCoreClock / 1000 - 1;

    //使能系统节拍时钟中断
    SysTick->CTRL |= 0x02;

    //使能系统节拍时钟
    SysTick->CTRL |= 0x01;
}
/**************************************************************************************
* 函数名：delay_ms()
* 参数  ：uint32_t n  延时的毫秒数
* 返回值：void
* 描述  ：使用系统节拍进行精准延时函数
***************************************************************************************/
void delay_ms(uint32_t n)
{
    timeout = n;                //设置系统节拍延时
    while (timeout != 0);     //等待延时时间到
}
/**************************************************************************************
* 函数名：delay()
* 参数  ：uint32_t n  延时的循环个数
* 返回值：void
* 描述  ：简单的循环延时函数
***************************************************************************************/
void delay(uint32_t n)
{
    while (n--);
}

